// 1) вивести в консоль числа від 1 до 5.
// 1
// 2
// 3
// 4
// 5

for (let i = 1; i < 6; i++) {
    console.log(i);
}

// 2) вивести в консоль числа від 5 до 1.
// 5
// 4
// 3
// 2
// 1

for (let i = 1; i <= 6; i++) {
    console.log(6 - i);
}

// 3) вивести в консоль табличку множення на 5.
// 3*1=3
// 3*2=6
// 3*3=9
// 3*4=12
// 3*5=15
// 3*6=18
// 3*7=21
// 3*8=24
// 3*9=27
// 3*10=30

for (let i = 1; i <= 10; i++) {
    console.log('3' + '*' + i + '=' + i*3);
}

// 4) вивести в консоль таку послідовність 
// 7 
// 14 
// 21 
// 28 
// 35 
// 42 
// 49 
// 56 
// 63 
// 70 
// 77 
// 84 
// 91 
// 98
for (let i = 7; i < 100; i = i + 7) {
    console.log (i);
}

// 5) вивести в консоль таку послідовність
// 1 
// 2 
// 4 
// 8 
// 16 
// 32 
// 64 
// 128 
// 256 
// 512
for (let i = 1; i < 600; i = i * 2) {
    console.log(i);
}

// 6) створити масив і циклом наповнити його цифрами від 1 до 10
// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
let arr6 = [];
for (let i = 0; i < 10; i++) {
	arr6[i] = i + 1;
}
console.log(arr6);

// 7) створити масив і циклом наповнити його цифрами від 20 до 10
// [20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10]
let arr7 = [];
for (let i = 0; i < 11; i++) {
    arr7[i] = 20 - i; 
}
console.log(arr7);

// 8) створити два масив і циклом наповнити один парними цифрами, другий - не парними. В діапазоні від 1 до 10
// [1, 3, 5, 7, 9]
// [2, 4, 6, 8, 10]


let arr8 = [];
let arr9 = [];

for (let i = 1; i <= 10; i++) {
   if (i % 2 === 0) {
       arr8[i] = i;
   }
   else {
       arr9[i] = i;
   } 
  
}
console.log(arr8);
console.log(arr9);

// 9) створити змінну записати в неї факторіал 10. вирахувати циклом
// 3628800

// 10) створити змінну і записати в неї 2 в степені 10. вирахувати циклом
// 1024





